<?php
$table=[
    "", //ページ番号とindexを対応させるため
    "流体と流体力学",
    "流体の運動と力",
    "流体の諸特性",
    "流体力学の基礎方程式",
    "完全流体の運動の一般論",
    "水の波",
    "ポテンシャル波",
    "2次元ポテンシャル流",
    "渦運動",
    "音波と衝撃波",
    "高速気流",
    "粘性流の一般論",
    "代表的な粘性流",
    "遅い粘性流",
    "境界層",
    "流れの安定性",
    "乱流"
];
$page_max=count($table)-1; //0番目を潰したから1引く

if($flag){
    echo("<h3>目次</h3>");
    echo("<ul>");
    for($i=1;$i<=$page_max;$i++){
        echo("<li>");
        echo("<a href=".$i.".html><h4>".$table[$i]."</h4></a>");
        echo("</li>");
    }
    echo("</ul>");
    $flag=false;
}
?>